Repository: Abdull/cbgooglemaps
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# pluginWizardDescription
source: Add a GoogleMap, MapBox or OpenStreetMap to the current page in a quick and simple way
de: Füge eine GoogleMap, MapBox or OpenStreetMap zur aktuellen Seite auf einfach und schnelle Weise hinzu

# label.street
source: Street
de: Straße

# label.zip
source: zip
de: Postleitzahl

# label.city
source: city
de: Stadt

# label.latitude
source: latitude
de: Breitengrad

# label.longitude
source: longitude
de: Längengrad

# label.country
source: country
de: Land

# label.map
source: map
de: Karte

# label.buttonGeocoding
source: fetch coordinates from address
de: Ermittle Koordinaten aus obiger Adresse

# label.description
source: description of map and position
de: Karten- und Ortsbeschreibung

# label.autoOpen
source: open map description on startup
de: Öffne Informationsblase (Karten- und Ortsbeschreibung) automatisch

# label.sheetLocation
source: location
de: Ortsangabe /-definition

# label.sheetDisplay
source: display properties
de: Kartendarstellung

# label.mapWidth
source: map width, in pixel (only visible to the frontend view!)
de: Breite der Karte, in Pixel (nur im Frontend wirksam!)

# label.mapHeight
source: map height, in pixel (only visible to the frontend view!)
de: Höhe der Karte, in Pixel (nur im Frontend wirksam!)

# label.mapType
source: map type (only GoogleMaps)
de: Art der Kartendarstellung (nur GoogleMaps und MapBox)

# label.mapTypeRoadmap
source: GoogleMaps: roadmap
de: GoogleMaps: Straßenkarte

# label.mapTypeTerrain
source: GoogleMaps: terrain
de: GoogleMaps: Geländeansicht

# label.mapTypeHybrid
source: GoogleMaps: hybrid
de: GoogleMaps: Gemischte Darstellung

# label.mapTypeSatellite
source: GoogleMaps: satellite
de: GoogleMaps: Satellitenansicht

# label.mapTypeMapbox.Basic
source: MapBox: default simple
de: MapBox: Standard einfach

# label.mapTypeMapbox.Streets
source: MapBox: streets
de: MapBox: Straßenkarte

# label.mapTypeMapbox.Bright
source: MapBox: bright
de: MapBox: strahlend

# label.mapTypeMapbox.Light
source: MapBox: light
de: MapBox: hell

# label.mapTypeMapbox.Dark
source: MapBox: dark
de: MapBox: dunkel

# label.mapTypeMapbox.Satellite
source: MapBox: satellite
de: MapBox: Satellitenansicht

# label.scaleLevel
source: card zoom level
de: Karten Zoom-Stufe

# label.navigationControl
source: navigation controls (only GoogleMaps)
de: Steuerelemete zur Navigation (nur GoogleMaps)

# label.navigationControlDefault
source: GoogleMaps: default
de: GoogleMaps: Standard

# label.navigationControlSmall
source: GoogleMaps: small controls
de: GoogleMaps: kleine Steuerelemente

# label.navigationControlZoomPan
source: GoogleMaps: bigger controls
de: GoogleMaps: größere Steuerlemente

# label.navigationControlAndroid
source: GoogleMaps: small controls (used in Android)
de: GoogleMaps: Minimale Steuerelemente (ähnlich zur Android-Darstellung)

# 1mapprovider
source: Map provider
de: Kartenanbieter

# 5mapsetting
source: Map settings
de: Karten Einstellungen

# const.mapProvider
source: Map Provider: Select desired map provider to be used for map drawing (GoogleMaps and MapBox requires a key)
de: Kartenanbieter: Wähle den gewünschten Kartenanbieter zur Darstellung der Karte aus (GoogleMaps und MapBox benötigen zwingend einen Nutzungs-Schlüssel/Api-Key)

# const.osmapi.js
source: OpenStreetMap JS library: Set URL to openstreetmap javascript library
de: OpenStreetMap JS Bibliothek: Gebe den Pfad zur Einbindung der OpenStreetMap JavaScript Bibliothek an

# const.osmapi.css
source: OpenStreetMap Styles: Set URL to openstreetmap stylessheet
de: OpenStreetMap Stile: Gebe den Pfad zur Einbindung der OpenStreetMap Stile an

# const.osmapi.tileLayer.template
source: Tile layer template: Set template string to the tile layer
de: Kachelebenen Tempate: Gebe das Kachelebenen-Template an (Tile layer template)

# const.osmapi.tileLayer.attribution
source: Tile layer attribution: Set attribution string to the tile layer
de: Kachelebenen Quellverweis: Gebe den einzublendenen Quellverweis zur Karte ein (Tile layer attribution)

# const.osmapi.icon.iconUrl
source: OpenStreetMap icon: Set URL to openstreetmap icon (f.e. fileadmin/images/osmMarker.png)
de: OpenStreetMap Ikon: Gebe ein optionales eigenes Ikon zur Positionsanzeige ein (bspw. fileadmin/images/osmMarker.png)

# const.osmapi.icon.iconWidth
source: OpenStreetMap icon width: Set icon width in pixel
de: OpenStreetMap Ikon Breite: Gebe die Ikonbreite in Pixel an

# const.osmapi.icon.iconHeight
source: OpenStreetMap icon height: Set icon height in pixel
de: OpenStreetMap Ikon Höhe: Gebe die Ikonhöhe in Pixel an

# const.osmapi.icon.iconAnchorX
source: OpenStreetMap icon anchor X: Horizontal position (x) for marker pixel in icon (in pixel)
de: OpenStreetMap Ikon Anker X: Horizontale Position (x) für den Markerpixel im Ikon (in Pixel)

# const.osmapi.icon.iconAnchorY
source: OpenStreetMap icon anchor Y: Vertical position (y) for marker pixel in icon (in pixel)
de: OpenStreetMap Ikon Anker Y: VertiKale position (y) für den Markerpixel im Ikon (in Pixel)

# const.osmapi.icon.popupAnchorX
source: OpenStreetMap popup anchor X: Horizontal position (x) for popup arrow position (in pixel)
de: OpenStreetMap Popup Anker X: Horizontale Position (x) für das Popup (in Pixel)

# const.osmapi.icon.popupAnchorY
source: OpenStreetMap popup anchor Y: Vertical position (y) for popup arrow position (in pixel)
de: OpenStreetMap Popup Anker Y: Vertikale Position (y) für das Popup (in pixel)

# const.osmapi.icon.tooltipAnchorX
source: OpenStreetMap tooltip anchor X: Horizontal position (x) for tooltip in pixel relative to the icon
de: OpenStreetMap Tooltip Anker X: Horizontale Position (x) für den Tooltip in pixel

# const.osmapi.icon.tooltipAnchorY
source: OpenStreetMap tooltip anchor Y: Vertical position (y) for tooltip in pixel relative to the icon
de: OpenStreetMap Tooltip Anker Y: Vertikale Position (y) für den Tooltip in pixel

# const.osmapi.icon.shadowUrl
source: OpenStreetMap shadow url: Set URL to openstreetmap icon shadow (f.e. fileadmin/images/osmMarkerShadow.png)
de: OpenStreetMap Ikonschatten Url: Gebe optional die URL zum OpenStreetMap Ikonschatten an (f.e. fileadmin/images/osmMarkerShadow.png)

# const.osmapi.icon.shadowWidth
source: OpenStreetMap shadow width: Set icon shadow width in pixel
de: OpenStreetMap Ikonschatten Breite: Gebe die Breite des Ikonschattens in Pixel an

# const.osmapi.icon.shadowHeight
source: OpenStreetMap shadow height: Set icon shadow width in pixel
de: OpenStreetMap Ikonschatten Höhe: Gebe die Höhe des Ikonschattens in Pixel an

# const.osmapi.icon.shadowAnchorX
source: OpenStreetMap shadow anchor X: Horizontal position (x) for marker pixel in icon shadow
de: OpenStreetMap Ikonschatten Anker X: Horizontale Position (x) für den Markerpixel des Ikonschattens

# const.osmapi.icon.shadowAnchorY
source: OpenStreetMap shadow anchor Y: Vertical position (y) for marker pixel in icon shadow
de: OpenStreetMap Ikonschatten Anker Y: Vertikale Position (y) für den Markerpixel des Ikonschattens

# const.mapboxapi.js
source: MapBox JS library: Set URL to mapbox javascript library
de: MapBox JS Bibliothek: Gebe die URL zur MapBox JavaScript Bibliothek an

# const.mapboxapi.css
source: MapBox Styles: Set URL to mapbox stylessheet
de: MapBox Stile: Gebe die URL zum MapBox Stilset an

# const.mapboxapi.accessToken
source: MapBox access token: Set access token of mapbox, see: https://www.mapbox.com/account/access-tokens to request a token
de: MapBox Zugriffstoken: Geben den Zugriffstoken für MapBox an, see: https://www.mapbox.com/account/access-tokens zur Anforderung eines Tokens

# const.mapboxapi.icon.iconUrl
source: OpenStreetMap icon: Set URL to mapbox icon (f.e. fileadmin/images/osmMarker.png)
de: MapBox Ikon: Gebe ein optionales eigenes Ikon zur Positionsanzeige ein (bspw. fileadmin/images/osmMarker.png)

# const.mapboxapi.icon.iconWidth
source: OpenStreetMap icon width: Set icon width in pixel
de: MapBox Ikon Breite: Gebe die Ikonbreite in Pixel an

# const.mapboxapi.icon.iconHeight
source: OpenStreetMap icon height: Set icon height in pixel
de: MapBox Ikon Höhe: Gebe die Ikonhöhe in Pixel an

# const.mapboxapi.icon.iconOffsetX
source: MapBox icon offset x: Set icon horizontal offset in pixel
de: Mapbox Ikon-Offset X: Gebe den horizontalen Offset in Pixel an

# const.mapboxapi.icon.iconOffsetY
source: MapBox icon offset y: Set icon vertical offset in pixel
de: Mapbox Ikon-Offset Y: Gebe den vertikalen Offset in Pixel an

# const.googleapi.url
source: GoogleMaps JS library: Set URL to googlemaps javascript library
de: GoogleMaps JS library: Gebe die URL zur GoogleMaps JavaScript Bibliothek an

# const.googleapi.key
source: GoogleMaps api key: Set googlemaps api key see: https://developers.google.com/maps/documentation/javascript/ to request an api key
de: GoogleMaps Api Schlüssel: Gebe den GoogleMaps Api Schlüssel an, see: https://developers.google.com/maps/documentation/javascript/ zur Anforderung eines Api Schlüssels

# const.options.useScrollwheel
source: Activte zooming by mousewheel: Use scrollwheel for zooming in maps?
de: Vergrößerung per Mausrad: Aktiviere die Vergrößerung per Mausrad in Karten?

# const.latitude
source: Default latitude: Set latitude as float value, if you would like to set some default coordinates
de: Standard Breitengrad: Gebe, sofern gewünscht, einen Standardbreitengrade an

# const.longitude
source: Default longitude: Set longitude as float value, if you would like to set some default coordinates
de: Standard Längengrad: Gebe, sofern gewünscht, einen Standardlängengrad an

# const.infoText
source: Default info text: Set info text to be shown in the text box to the pin as default
de: Standardtext: Gebe einen Standardtext zur Infobox der Kartenposition an

# const.infoTextOpen
source: Open info text box: Should info text box be opened at start?
de: Standardtext anzeigen?: Soll der Standardtext direkt zur Kartendarstellung angezeigt werden?

# const.display.width
source: Default map width: Set default width of map (in pixel), if empty 100% width will be used and map will be resonsive
de: Kartenbreite: Gebe die gewünschte Breite der Karte in Pixel an - wird keine Breite angegeben, so wird 100% Breite angenommen und die Karte verhält sich responsiv.

# const.display.height
source: Default map height: Set default height of map (in pixel)
de: Kartenhöhe: Gebe die gewünschte Höhe der Karte in Pixel an

# const.display.zoom
source: Default zoom level: Set default map zoom level (default = 15)
de: Standardvergrößerung: Gebe die Standardvergrößerungsstufe zur Karte an

# const.display.maptype
source: Default map type: Set default map type
de: Kartentyp: Gebe den Typ der Kartendarstellung an

# const.display.mapcontrol
source: Default map controls: Select map controls which should be shown in the map
de: Steuerungselemente: Gebe an, welche Kartensteuerelemente dargestellt werden sollen

# const.display.icon
source: Map icon: Alternate map icon (only GoogleMaps): path: relative to document root (e.g. "fileadmin/images/googlePin.png"), the targeting point resides to the center bottom of the graphic file.
de: GoogleMaps Ikon: Gebe ein optionales eigenes Ikon zur Positionsanzeige ein (bspw. fileadmin/images/osmMarker.png)

# const.display.styling
source: Alternate map styling (only GoogleMaps): path: relative to document root (e.g. "fileadmin/images/googleStyles.txt").
de: Kartenstile (nur GoogleMaps): Gebe URL zu den Kartenstilen an (bspw. "fileadmin/images/googleStyles.txt").
